Blog/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_article(param_int)
    param = validate(param_int)
    if param.present?
      begin
        article = Article.find(param)